       PERFORM PROCEDIMIENTO-DE-APERTURA.
       MOVE "S" TO SI-NO.
       PERFORM AGREGAR-REGISTROS UNTIL SI-NO = "N".
       PERFORM PROCEDIMIENTO-DE-CIERRE.
