       PROCEDIMIENTO-DE-CIERRE.
       CLOSE EMPLEADOS-ARCHIVO.

       AGREGAR-REGISTROS.
       MOVE "N" TO ENTRADA.
       PERFORM OBTENER-CAMPOS UNTIL ENTRADA = "S".
       PERFORM ESCRIBIR-REGISTRO.
       PERFORM REINICIAR.

       OBTENER-CAMPOS.
       MOVE SPACE TO EMPLEADOS-REGISTRO.
       DISPLAY IDENTIFICADOR.
       ACCEPT EMPLEADOS-ID.
       DISPLAY NOMBRE.
       ACCEPT EMPLEADOS-NOMBRE.
       DISPLAY APELLIDO.
       ACCEPT EMPLEADOS-APELLIDO.
       DISPLAY EDAD.
       ACCEPT EMPLEADOS-EDAD.
       DISPLAY TELEFONO.
       ACCEPT EMPLEADOS-TELEFONO.
       DISPLAY DIRECCION.
       ACCEPT EMPLEADOS-DIRECCION.
       PERFORM CONTINUAR.

       ESCRIBIR-REGISTRO.
       WRITE EMPLEADOS-REGISTRO.

       REINICIAR.
       DISPLAY "Desea almacenar otro empleado".
       ACCEPT SI-NO.
       IF SI-NO = "S" OR SI-NO = "s"
       MOVE "S" TO SI-NO.
       IF SI-NO NOT = "S" AND SI-NO NOT = "s"
       MOVE "N" TO SI-NO.
