       01 IDENTIFICADOR PIC X(36)
           VALUE "Introduce el Id del nuevo empleado".
       01 NOMBRE PIC X(40)
           VALUE "Introduce el nombre del nuevo empleado".
       01 APELLIDO PIC X(43)
           VALUE "Introduce el apellido  del nuevo empleado".
       01 EDAD PIC X(40)
           VALUE "Introduce la edad del nuevo empleado".
       01 TELEFONO PIC X(43)
           VALUE "Introduce el telefono  del nuevo empleado".
       01 DIRECCION PIC X(43)
           VALUE "Introduce la direccion del nuevo empleado".

       01 SI-NO PIC X VALUE SPACE.
       01 ENTRADA PIC X VALUE SPACE.
