000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "SHEET1".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-SHEET1 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--SHEET1.
000013     03 SHEET1 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  SHEET1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--VISOR-CIEN.
000013     03 VISOR-CIEN PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  VISOR-CIEN USAGE POINTER.
000013   02 POWER--HPOWOBJ--BTN-INC.
000013     03 BTN-INC PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  BTN-INC USAGE POINTER.
000013   02 POWER--HPOWOBJ--VISOR-UNO.
000013     03 VISOR-UNO PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  VISOR-UNO USAGE POINTER.
000013   02 POWER--HPOWOBJ--VISOR-DIEZ.
000013     03 VISOR-DIEZ PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  VISOR-DIEZ USAGE POINTER.
000013   02 POWER--HPOWOBJ--CONT-UNO.
000013     03 CONT-UNO PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  CONT-UNO USAGE POINTER.
000013   02 POWER--HPOWOBJ--CONT-CIEN.
000013     03 CONT-CIEN PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  CONT-CIEN USAGE POINTER.
000013   02 POWER--HPOWOBJ--CONT-DIEZ.
000013     03 CONT-DIEZ PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  CONT-DIEZ USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL1.
000013     03 LABEL1 PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  LABEL1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL2.
000013     03 LABEL2 PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  LABEL2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL3.
000013     03 LABEL3 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  LABEL3 USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-SHEET1.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 11 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017 CONSTANT SECTION.
000018 LINKAGE SECTION.
000019 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000020 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000021                    USAGE IS COMPUTATIONAL-5.
000022 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000023                    USAGE IS COMPUTATIONAL-5.
000024 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000025                    USAGE IS COMPUTATIONAL-5.
000026 PROCEDURE DIVISION
000027     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000028     EVALUATE POWER--MESSAGE
000029     WHEN 1025
000030         EVALUATE POWER--HPOWOBJ
000031         WHEN POWER--HPOWOBJ--VISOR-CIEN
000032             EVALUATE POWER--NOTIFY
000033             WHEN 7 
000034                CALL "VISOR-CIEN-CHANGE"
000035             WHEN 27 
000036                CALL "VISOR-CIEN-RETURN"
000037             END-EVALUATE
000038         WHEN POWER--HPOWOBJ--BTN-INC
000039             EVALUATE POWER--NOTIFY
000040             WHEN 1 
000041                CALL "BTN-INC-CLICK"
000042             END-EVALUATE
000043         END-EVALUATE
000044     WHEN 1024
000045         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000046     WHEN 1038
000047         CALL "SHEET1-START"
000048     END-EVALUATE
000049     EXIT PROGRAM.
000050 IDENTIFICATION DIVISION.
000051 PROGRAM-ID. "SHEET1-START".
000052 PROCEDURE DIVISION.
000053     EXIT PROGRAM.
000054 END PROGRAM "SHEET1-START".
000055 IDENTIFICATION DIVISION.
000056 PROGRAM-ID. "VISOR-CIEN-CHANGE".
000057 ENVIRONMENT DIVISION.
000058 DATA        DIVISION.
000059 PROCEDURE   DIVISION
000060 END PROGRAM "VISOR-CIEN-CHANGE".
000061 IDENTIFICATION DIVISION.
000062 PROGRAM-ID. "VISOR-CIEN-RETURN".
000063ENVIRONMENT DIVISION.
000064DATA DIVISION.
000065PROCEDURE DIVISION.
000066 END PROGRAM "VISOR-CIEN-RETURN".
000067 IDENTIFICATION DIVISION.
000068 PROGRAM-ID. "BTN-INC-CLICK".
000069 ENVIRONMENT DIVISION.
000070 DATA        DIVISION.
000071 WORKING-STORAGE SECTION. 
000072 77 CONTADOR-UNO PIC 9999 VALUES ZEROS.
000073 77 CONTADOR-DIEZ PIC 9999 VALUES ZEROS.
000074 77 CONTADOR-CIEN PIC 9999 VALUES ZEROS.
000075 77 INCREMENTO-UNO PIC 9999 VALUES ZEROS.
000076 77 INCREMENTO-DIEZ PIC 9999 VALUES ZEROS.
000077 77 INCREMENTO-CIEN PIC 9999 VALUES ZEROS.
000078 77 COUNT-ONE PIC 9999 VALUES ZEROS.
000079 77 COUNT-TEN PIC 9999 VALUES ZEROS.
000080 77 COUNT-HUNDRED PIC 9999 VALUES ZEROS.
000080 77 POW-0001 PIC X(256) .
000080 77 POW-0002 PIC X(256) .
000080 77 POW-0003 PIC X(256) .
000080 77 POW-0004 PIC X(256) .
000080 77 POW-0005 PIC X(256) .
000080 77 POW-0006 PIC X(256) .
000080 77 POW-0007 PIC X(256) .
000080 77 POW-0008 PIC X(256) .
000080 77 POW-0009 PIC X(256) .
000080 77 POW-0010 PIC X(256) .
000080 77 POW-0011 PIC X(256) .
000080 77 POW-0012 PIC X(256) .
000081 PROCEDURE DIVISION.
000082 CALL  "XPOWEDITGETTEXT"  USING BY VALUE VISOR-UNO  BY REFERENCE POW-0001 .
000082 MOVE POW-0001 TO CONTADOR-UNO.
000083 CALL  "XPOWEDITGETTEXT"  USING BY VALUE VISOR-DIEZ  BY REFERENCE POW-0002 .
000083 MOVE POW-0002 TO CONTADOR-DIEZ.
000084 CALL  "XPOWEDITGETTEXT"  USING BY VALUE VISOR-CIEN  BY REFERENCE POW-0003 .
000084 MOVE POW-0003 TO CONTADOR-CIEN.
000085 ADD 1 TO INCREMENTO-UNO.
000086 ADD 10 TO INCREMENTO-DIEZ.
000087 ADD 100 TO INCREMENTO-CIEN.
000088 IF INCREMENTO-UNO = 1000 THEN
000089     MOVE  0000  TO POW-0004
000089     CALL  "XPOWEDITSETTEXT"  USING BY VALUE VISOR-UNO  BY REFERENCE POW-0004 
000090     MOVE ZEROS TO INCREMENTO-UNO
000091     ADD 1 TO COUNT-ONE
000092     MOVE  COUNT-ONE  TO POW-0005
000092     CALL  "XPOWCWSETTEXT"  USING BY VALUE CONT-UNO  BY REFERENCE POW-0005 
000093 ELSE
000094     MOVE  INCREMENTO-UNO  TO POW-0006
000094     CALL  "XPOWCWSETTEXT"  USING BY VALUE VISOR-UNO  BY REFERENCE POW-0006 
000095 END-IF.
000096 
000097 IF INCREMENTO-DIEZ = 1000 THEN
000098     MOVE  0000  TO POW-0007
000098     CALL  "XPOWEDITSETTEXT"  USING BY VALUE VISOR-DIEZ  BY REFERENCE POW-0007 
000099     MOVE ZEROS TO INCREMENTO-DIEZ
000100     ADD 1 TO COUNT-TEN
000101     MOVE  COUNT-TEN  TO POW-0008
000101     CALL  "XPOWCWSETTEXT"  USING BY VALUE CONT-DIEZ  BY REFERENCE POW-0008 
000102 ELSE
000103     MOVE  INCREMENTO-DIEZ  TO POW-0009
000103     CALL  "XPOWCWSETTEXT"  USING BY VALUE VISOR-DIEZ  BY REFERENCE POW-0009 
000104 END-IF.
000105
000106 IF INCREMENTO-CIEN = 1000 THEN
000107     MOVE  0000  TO POW-0010
000107     CALL  "XPOWEDITSETTEXT"  USING BY VALUE VISOR-CIEN  BY REFERENCE POW-0010 
000108     MOVE ZEROS TO INCREMENTO-CIEN
000109     ADD 1 TO COUNT-HUNDRED
000110     MOVE  COUNT-HUNDRED  TO POW-0011
000110     CALL  "XPOWCWSETTEXT"  USING BY VALUE CONT-CIEN  BY REFERENCE POW-0011 
000111 ELSE
000112     MOVE  INCREMENTO-CIEN  TO POW-0012
000112     CALL  "XPOWCWSETTEXT"  USING BY VALUE VISOR-CIEN  BY REFERENCE POW-0012 
000113 END-IF.
000114 END PROGRAM "BTN-INC-CLICK".
000115 END PROGRAM "SHEET1".
